4.9

## Outline

1. Outline

2. Import

3. Exploring Data

4. Formatting Data

5. Checking Data

6. Export

## Import

In [1]:
import pandas as pd
import numpy as np
import os

In [3]:
customer_data_set = pd.read_csv('/Users/christinarandall/Documents/Career Foundry Projects/Achievment 4/Data/Orginal Data/customers.csv')

In [12]:
cds = customer_data_set

## Exploring Data

In [11]:
cds.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [16]:
cds.shape

(206209, 10)

In [17]:
cds.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [52]:
#Based on the below data; I will be dropping date_joined in the next section

In [22]:
cds['date_joined'].max()

'9/9/2019'

In [21]:
cds['date_joined'].min()

'1/1/2017'

In [41]:
cds['Gender'].value_counts()

Male      104067
Female    102142
Name: Gender, dtype: int64

In [42]:
cds['fam_status'].value_counts()

married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: fam_status, dtype: int64

In [44]:
cds['Age'].median()

49.0

In [46]:
cds['Age'].describe()

count    206209.000000
mean         49.501646
std          18.480962
min          18.000000
25%          33.000000
50%          49.000000
75%          66.000000
max          81.000000
Name: Age, dtype: float64

In [47]:
cds.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

## Formating Data

In [51]:
#Dropping the date_joined column

In [78]:
cds = cds.drop(columns = ['date_joined'])

In [59]:
#renaming column headers

In [60]:
cds.rename(columns = {'First Name' : 'first_name', 'Surnam' : 'last_name', 'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age', 'First Name' : 'first_name', 'fam_status' : 'martial_status'}, inplace = True)

In [79]:
cds.head(1)

,user_id,first_name,last_name,gender,state,age,n_dependants,martial_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665

## Checking Data

In [80]:
#Checking Data for mixed data types

In [81]:
for col in cds.columns.tolist():
  weird = (cds[[col]].applymap(type) != cds[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cds[weird]) > 0:
    print (col)

first_name

In [82]:
cds['first_name'].dtypes

dtype('O')

In [84]:
cds['first_name'].sample(100)

204922       Norma
26381     Kimberly
108106        Ruby
152885        Ruth
49305          NaN
            ...
95688      Brandon
73268        Steve
193919         NaN
188018        Carl
169268       Julia
Name: first_name, Length: 100, dtype: object

In [85]:
#This shows that the mixed data type is likley for NaN values

In [87]:
cds[cds['first_name'].isnull() == True]

,user_id,first_name,last_name,gender,state,age,n_dependants,martial_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,3,married,151819
...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,2,married,59222

In [88]:
cds.shape

(206209, 9)

In [89]:
cds_nan_test = cds

In [92]:
cds_nan_test.dropna(subset = ['first_name'], inplace = True)

In [93]:
#Testing to see if our NaN values were the mixed data type

In [94]:
for col in cds_nan_test.columns.tolist():
  weird = (cds_nan_test[[col]].applymap(type) != cds_nan_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cds_nan_test[weird]) > 0:
    print (col)

In [103]:
#As we had no output for the above we can safley say that our NaN values were our mixed data type.
#Moving forward, I will be dropping the NaN values in the data base as the make up only 5.5% of the data base

In [ ]:
#Checking for duplicates of whole data base

In [102]:
cds[cds.duplicated()]

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, n_dependants, martial_status, income]
Index: []

## Exporting Data

In [106]:
cds.to_pickle('/Users/christinarandall/Documents/Career Foundry Projects/Achievment 4/Data/Prepared Data/cds.pkl', )